<?php

namespace App\Http\Controllers;

use App\User;
use Illuminate\Http\Request;
use Illuminate\Support\Facades\Route;
use Illuminate\Support\Facades\Auth;

class BestController extends Controller
{
    function __construct()
    {
        $this->middleware('auth');
        $this->middleware('ask.participation');
    }

    public static function routes()
    {

        Route::group(['prefix' => 'bests', 'as' => 'bests.'], function () {
            Route::get('/', 'BestController@bests')->name('main');
            Route::post('/', 'BestController@bestsAction')->name('mainAction');

        });
    }

    public function bests()
    {
        $user = Auth::user();
        $answers = $user['bests_q'] ? json_decode($user['bests_q'], true) : [];
        $users = User::whereIn('_id', $answers)->get()->keyBy('id');
        return view('pages.bests.bests', [
            'titles' => $this->titles(),
            'answers' => $answers,
            'users' => $users
        ]);
    }

    public function bestsAction(Request $request)
    {
        $user = Auth::user();
        $q = $request->get('q');
        $user->bests_q = json_encode($q);
        $user->save();
        return redirect()->route('landing')->with('success', 'با موفقیت ثبت شد');
    }


    public static function titles()
    {
        // 86
        return [
            2 => "اجتماعی ترین",
            3 => "احساسی ترین",
            4 => "بپیچون ترین",
            5 => "بدشانس ترین",
            6 => "پر حرف ترین",
            7 => "پرکار ترین",
            8 => "تدریس یار ترین",
            9 => "تغییر پیدا کرده ترین",
            10 => "جزوه نویس ترین",
            11 => "جو بده ترین",
            12 => "خسته ترین",
            13 => "خوش خنده ترین",
            14 => "خوش شانس ترین",
            15 => "رک ترین",
            16 => "خوش برخورد ترین",
            17 => "شاخ ترین",
            18 => "شکمو ترین",
            19 => "سم ترین",
            20 => "خجسته ترین",
            21 => "شوخ طبع ترین",
            22 => "کپ زن ترین",
            23 => "کم پیدا ترین",
            24 => "مودب ترین",
            25 => "پر استرس ترین",
            26 => "نمره بگیر ترین",
            27 => "ورزشکار ترین",
            28 => "دوست داشتنی ترین",
            29 => "یعقوب برو ترین",
            30 => "خوش اخلاق ترین",
            31 => "بیخیال ترین",
            32 => "یخ ترین",
            33 => "پایه ترین",
            34 => "خجالتی ترین",
            35 => "مهربون ترین",
            36 => "نرد ترین",
            37 => "با جنبه ترین",
            38 => "با مرام ترین",
            39 => "آنلاین ترین",
            40 => "کم حافظه ترین",
            41 => "هنرمند ترین",
            42 => "تیکه پرون ترین",
            43 => "خوش خواب ترین",
            44 => "جدی ترین",
            45 => "دلسوز ترین",
            46 => "بد امتحان بده ترین",
            47 => "خونسرد ترین",
            48 => "رئیس ترین",
            49 => "آروم ترین",
            50 => "علاف ترین",
            51 => "زود سر کلاس برو ترین",
            52 => "سحرخیز ترین",
            53 => "زود رنج ترین",
            54 => "صدا قشنگ ترین",
            55 => "گیج ترین",
            56 => "مغرور ترین",
            57 => "منطقی ترین",
            58 => "پر انرژی ترین",
            59 => "پیگیر ترین",
            60 => "با جذبه ترین",
            61 => "پر سر و صدا ترین",
            62 => "بی احساس ترین",
            63 => "بی تفاوت ترین",
            64 => "سوال بپرس ترین",
            65 => "تمدید کن ترین",
            66 => "جغدترین",
            67 => "متاخر ترین",
            68 => "سرکلاس بیرون برو ترین",
            69 => "خوش تیپ ترین",
            70 => "تنبل ترین ",
            71 => "کیوت ترین",
            72 => "آویزون استاد ترین",
            73 => "جنتلمن ترین",
            74 => "سیاسی ترین",
            75 => "مسئولیت پذیر ترین",
            76 => "ته نشین ترین",
            77 => "کلاس بپیچون ترین ",
            78 => "کافه برو ترین",
            79 => "غرغرو ترین",
            80 => "ساکت ترین",
            81 => "فیلم بین ترین",
            82 => "کتابخون ترین",
            83 => "کنسل کن ترین",
            84 => "عجیب ترین",
            85 => "پررو ترین",
            86 => "دست و دلباز ترین",
        ];
    }
}
